// Задача 66. Домашнее задание.
// Задайте значения M и N. Напишите программу, которая найдёт сумму натуральных элементов в промежутке от M до N.

// M = 1; N = 15 -> 120
// M = 4; N = 8. -> 30

// ввод значения. запрашивает ввод, конвертирует в int32 и возвращает это число. Принимает bool - необходимость выполнения проверки знака числа.
int GetDataTryParse(bool signControl)
{
    bool testDigits = false;
    int result = 0;
    while (!testDigits)
    {
        string? inputString = Console.ReadLine();
        //если введено число и контроль знака пройден, то парсим его и возвращаем
        if ((int.TryParse(inputString, out int data)) && ((data >= 0) || (!signControl)))
        {
            testDigits = true;
            result = data;
        }
        //если введено не число или контроль знака не пройден (при необходимости его проведения), то выводим предупреждение и предлагаем пользователю выбор
        else
        {
            Console.WriteLine("Не корректный ввод!!!");
            Console.WriteLine("Для завершения программы нажмите клавишу Esc.");
            Console.WriteLine("Для повторного ввода нажмите любую другую клавишу.");
            //ждём нажатия клавиши (клавиша не отображается, т.к. true), если Esc, то завершаем выполнение программы
            if (Console.ReadKey(true).Key == ConsoleKey.Escape)
                //Завершает этот процесс и возвращает код выхода операционной системе
                Environment.Exit(0);
            else
                Console.Write("Повторите ввод: ");
        }
    }
    return result;
}

//считает сумму чисел от m до n
int SumNumberInIntervalRec(int m, int n)
{
    return (m <= n) ? m + SumNumberInIntervalRec(m + 1, n) : 0;
}

Console.Clear();

Console.Write("Введите число M ");
int m = GetDataTryParse(true);
Console.Write("Введите число N ");
int n = GetDataTryParse(true);
int temp;
//контроль корректности ввода M и N
if (m > n)
{
    temp = m;
    m = n;
    n = temp;
}
Console.WriteLine($"Сумма чисел от {m} до {n} равна {SumNumberInIntervalRec(m, n)}");




